heatExchanger/all_auto/case_10_10/0/fluid/U
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  10
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       volVectorField;
    location    "0/fluid";
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [ 0 1 -1 0 0 0 0 ];

internalField   uniform (5.6 0 0);

boundaryField
{
    #includeEtc "caseDicts/setConstraintTypes"

    inlet_fluid
    {
        type            fixedValue;
        value           uniform (5.6 0 0);
    }
    
    outlet_fluid
    {
        type            pressureInletOutletVelocity;
        value           $internalField;
    }
    
    fluid_to_fins
    {
        type            noSlip;
    }

    walls_fluid
    {
        type            fixedValue;
        value           uniform (0 0 0);
    }
}

// ************************************************************************* //
